probe/src/DataProcessors/ОбработкаРаз/ОбработкаРаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаРаз</name>
</mdclass:DataProcessor>

probe/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

probe/src/DataProcessors/ОбработкаРаз/ObjectModule.bsl
Процедура ЧтениеИЗаписьНабораДанных(Знач Валюта, Знач Дата, Знач Курс)
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Попытка
		Блокировка_ = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка_.Добавить("РегистрСведений.КурсыВалют");
		ЭлементБлокировки.УстановитьЗначение("Валюта",Валюта);
		ЭлементБлокировки.УстановитьЗначение("Период",Дата);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка_.Заблокировать();
		НЗ = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
		НЗ.Отбор.Валюта.Установить(Валюта); 
		НЗ.Отбор.Период.Установить(Дата); 
		НЗ.Прочитать();
	    Для каждого Запись_ Из НЗ Цикл
		 	Запись_.Курс = Курс;
		КонецЦикла;
		НЗ.Записать();
	    ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры
